Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_IE_Bits.TSWE */
#define IFX_CAN_N_IE_TSWE_OFF (16u)

/** \brief Length for Ifx_CAN_N_IE_Bits.MRAFE */
#define IFX_CAN_N_IE_MRAFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.MRAFE */
#define IFX_CAN_N_IE_MRAFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.MRAFE */
#define IFX_CAN_N_IE_MRAFE_OFF (17u)

/** \brief Length for Ifx_CAN_N_IE_Bits.TOOE */
#define IFX_CAN_N_IE_TOOE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.TOOE */
#define IFX_CAN_N_IE_TOOE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.TOOE */
#define IFX_CAN_N_IE_TOOE_OFF (18u)

/** \brief Length for Ifx_CAN_N_IE_Bits.DRXE */
#define IFX_CAN_N_IE_DRXE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.DRXE */
#define IFX_CAN_N_IE_DRXE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.DRXE */
#define IFX_CAN_N_IE_DRXE_OFF (19u)

/** \brief Length for Ifx_CAN_N_IE_Bits.ELOE */
#define IFX_CAN_N_IE_ELOE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.ELOE */
#define IFX_CAN_N_IE_ELOE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.ELOE */
#define IFX_CAN_N_IE_ELOE_OFF (22u)

/** \brief Length for Ifx_CAN_N_IE_Bits.EPE */
#define IFX_CAN_N_IE_EPE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.EPE */
#define IFX_CAN_N_IE_EPE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.EPE */
#define IFX_CAN_N_IE_EPE_OFF (23u)

/** \brief Length for Ifx_CAN_N_IE_Bits.EWE */
#define IFX_CAN_N_IE_EWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.EWE */
#define IFX_CAN_N_IE_EWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.EWE */
#define IFX_CAN_N_IE_EWE_OFF (24u)

/** \brief Length for Ifx_CAN_N_IE_Bits.BOE */
#define IFX_CAN_N_IE_BOE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.BOE */
#define IFX_CAN_N_IE_BOE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.BOE */
#define IFX_CAN_N_IE_BOE_OFF (25u)

/** \brief Length for Ifx_CAN_N_IE_Bits.WDIE */
#define IFX_CAN_N_IE_WDIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.WDIE */
#define IFX_CAN_N_IE_WDIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.WDIE */
#define IFX_CAN_N_IE_WDIE_OFF (26u)

/** \brief Length for Ifx_CAN_N_IE_Bits.PEAE */
#define IFX_CAN_N_IE_PEAE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.PEAE */
#define IFX_CAN_N_IE_PEAE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.PEAE */
#define IFX_CAN_N_IE_PEAE_OFF (27u)

/** \brief Length for Ifx_CAN_N_IE_Bits.PEDE */
#define IFX_CAN_N_IE_PEDE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.PEDE */
#define IFX_CAN_N_IE_PEDE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.PEDE */
#define IFX_CAN_N_IE_PEDE_OFF (28u)

/** \brief Length for Ifx_CAN_N_GFC_Bits.RRFE */
#define IFX_CAN_N_GFC_RRFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_GFC_Bits.RRFE */
#define IFX_CAN_N_GFC_RRFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_GFC_Bits.RRFE */
#define IFX_CAN_N_GFC_RRFE_OFF (0u)

/** \brief Length for Ifx_CAN_N_GFC_Bits.RRFS */
#define IFX_CAN_N_GFC_RRFS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_GFC_Bits.RRFS */
#define IFX_CAN_N_GFC_RRFS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_GFC_Bits.RRFS */
#define IFX_CAN_N_GFC_RRFS_OFF (1u)

/** \brief Length for Ifx_CAN_N_GFC_Bits.ANFE */
#define IFX_CAN_N_GFC_ANFE_LEN (2u)

/** \brief Mask for Ifx_CAN_N_GFC_Bits.ANFE */
#define IFX_CAN_N_GFC_ANFE_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_GFC_Bits.ANFE */
#define IFX_CAN_N_GFC_ANFE_OFF (2u)

/** \brief Length for Ifx_CAN_N_GFC_Bits.ANFS */
#define IFX_CAN_N_GFC_ANFS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_GFC_Bits.ANFS */
#define IFX_CAN_N_GFC_ANFS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_GFC_Bits.ANFS */
#define IFX_CAN_N_GFC_ANFS_OFF (4u)

/** \brief Length for Ifx_CAN_N_SIDFC_Bits.FLSSA */
#define IFX_CAN_N_SIDFC_FLSSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_SIDFC_Bits.FLSSA */
#define IFX_CAN_N_SIDFC_FLSSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_SIDFC_Bits.FLSSA */
#define IFX_CAN_N_SIDFC_FLSSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_SIDFC_Bits.LSS */
#define IFX_CAN_N_SIDFC_LSS_LEN (8u)

/** \brief Mask for Ifx_CAN_N_SIDFC_Bits.LSS */
#define IFX_CAN_N_SIDFC_LSS_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_SIDFC_Bits.LSS */
#define IFX_CAN_N_SIDFC_LSS_OFF (16u)

/** \brief Length for Ifx_CAN_N_XIDFC_Bits.FLESA */
#define IFX_CAN_N_XIDFC_FLESA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_XIDFC_Bits.FLESA */
#define IFX_CAN_N_XIDFC_FLESA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_XIDFC_Bits.FLESA */
#define IFX_CAN_N_XIDFC_FLESA_OFF (2u)

/** \brief Length for Ifx_CAN_N_XIDFC_Bits.LSE */
#define IFX_CAN_N_XIDFC_LSE_LEN (7u)

/** \brief Mask for Ifx_CAN_N_XIDFC_Bits.LSE */
#define IFX_CAN_N_XIDFC_LSE_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_XIDFC_Bits.LSE */
#define IFX_CAN_N_XIDFC_LSE_OFF (16u)

/** \brief Length for Ifx_CAN_N_XIDAM_Bits.EIDM */
#define IFX_CAN_N_XIDAM_EIDM_LEN (29u)

/** \brief Mask for Ifx_CAN_N_XIDAM_Bits.EIDM */
#define IFX_CAN_N_XIDAM_EIDM_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_N_XIDAM_Bits.EIDM */
#define IFX_CAN_N_XIDAM_EIDM_OFF (0u)

/** \brief Length for Ifx_CAN_N_HPMS_Bits.BIDX */
#define IFX_CAN_N_HPMS_BIDX_LEN (6u)

/** \brief Mask for Ifx_CAN_N_HPMS_Bits.BIDX */
#define IFX_CAN_N_HPMS_BIDX_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_HPMS_Bits.BIDX */
#define IFX_CAN_N_HPMS_BIDX_OFF (0u)

/** \brief Length for Ifx_CAN_N_HPMS_Bits.MSI */
#define IFX_CAN_N_HPMS_MSI_LEN (2u)

/** \brief Mask for Ifx_CAN_N_HPMS_Bits.MSI */
#define IFX_CAN_N_HPMS_MSI_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_HPMS_Bits.MSI */
#define IFX_CAN_N_HPMS_MSI_OFF (6u)

/** \brief Length for Ifx_CAN_N_HPMS_Bits.FIDX */
#define IFX_CAN_N_HPMS_FIDX_LEN (7u)

/** \brief Mask for Ifx_CAN_N_HPMS_Bits.FIDX */
#define IFX_CAN_N_HPMS_FIDX_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_HPMS_Bits.FIDX */
#define IFX_CAN_N_HPMS_FIDX_OFF (8u)

/** \brief Length for Ifx_CAN_N_HPMS_Bits.FLST */
#define IFX_CAN_N_HPMS_FLST_LEN (1u)

/** \brief Mask for Ifx_CAN_N_HPMS_Bits.FLST */
#define IFX_CAN_N_HPMS_FLST_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_HPMS_Bits.FLST */
#define IFX_CAN_N_HPMS_FLST_OFF (15u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND0 */
#define IFX_CAN_N_NDAT1_ND0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND0 */
#define IFX_CAN_N_NDAT1_ND0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND0 */
#define IFX_CAN_N_NDAT1_ND0_OFF (0u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND1 */
#define IFX_CAN_N_NDAT1_ND1_LEN (1u)

