Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND24 */
#define IFX_CAN_N_NDAT1_ND24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND24 */
#define IFX_CAN_N_NDAT1_ND24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND24 */
#define IFX_CAN_N_NDAT1_ND24_OFF (24u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND25 */
#define IFX_CAN_N_NDAT1_ND25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND25 */
#define IFX_CAN_N_NDAT1_ND25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND25 */
#define IFX_CAN_N_NDAT1_ND25_OFF (25u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND26 */
#define IFX_CAN_N_NDAT1_ND26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND26 */
#define IFX_CAN_N_NDAT1_ND26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND26 */
#define IFX_CAN_N_NDAT1_ND26_OFF (26u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND27 */
#define IFX_CAN_N_NDAT1_ND27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND27 */
#define IFX_CAN_N_NDAT1_ND27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND27 */
#define IFX_CAN_N_NDAT1_ND27_OFF (27u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND28 */
#define IFX_CAN_N_NDAT1_ND28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND28 */
#define IFX_CAN_N_NDAT1_ND28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND28 */
#define IFX_CAN_N_NDAT1_ND28_OFF (28u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND29 */
#define IFX_CAN_N_NDAT1_ND29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND29 */
#define IFX_CAN_N_NDAT1_ND29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND29 */
#define IFX_CAN_N_NDAT1_ND29_OFF (29u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND30 */
#define IFX_CAN_N_NDAT1_ND30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND30 */
#define IFX_CAN_N_NDAT1_ND30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND30 */
#define IFX_CAN_N_NDAT1_ND30_OFF (30u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND31 */
#define IFX_CAN_N_NDAT1_ND31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND31 */
#define IFX_CAN_N_NDAT1_ND31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND31 */
#define IFX_CAN_N_NDAT1_ND31_OFF (31u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND32 */
#define IFX_CAN_N_NDAT2_ND32_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND32 */
#define IFX_CAN_N_NDAT2_ND32_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND32 */
#define IFX_CAN_N_NDAT2_ND32_OFF (0u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND33 */
#define IFX_CAN_N_NDAT2_ND33_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND33 */
#define IFX_CAN_N_NDAT2_ND33_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND33 */
#define IFX_CAN_N_NDAT2_ND33_OFF (1u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND34 */
#define IFX_CAN_N_NDAT2_ND34_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND34 */
#define IFX_CAN_N_NDAT2_ND34_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND34 */
#define IFX_CAN_N_NDAT2_ND34_OFF (2u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND35 */
#define IFX_CAN_N_NDAT2_ND35_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND35 */
#define IFX_CAN_N_NDAT2_ND35_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND35 */
#define IFX_CAN_N_NDAT2_ND35_OFF (3u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND36 */
#define IFX_CAN_N_NDAT2_ND36_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND36 */
#define IFX_CAN_N_NDAT2_ND36_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND36 */
#define IFX_CAN_N_NDAT2_ND36_OFF (4u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND37 */
#define IFX_CAN_N_NDAT2_ND37_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND37 */
#define IFX_CAN_N_NDAT2_ND37_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND37 */
#define IFX_CAN_N_NDAT2_ND37_OFF (5u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND38 */
#define IFX_CAN_N_NDAT2_ND38_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND38 */
#define IFX_CAN_N_NDAT2_ND38_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND38 */
#define IFX_CAN_N_NDAT2_ND38_OFF (6u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND39 */
#define IFX_CAN_N_NDAT2_ND39_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND39 */
#define IFX_CAN_N_NDAT2_ND39_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND39 */
#define IFX_CAN_N_NDAT2_ND39_OFF (7u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND40 */
#define IFX_CAN_N_NDAT2_ND40_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND40 */
#define IFX_CAN_N_NDAT2_ND40_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND40 */
#define IFX_CAN_N_NDAT2_ND40_OFF (8u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND41 */
#define IFX_CAN_N_NDAT2_ND41_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND41 */
#define IFX_CAN_N_NDAT2_ND41_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND41 */
#define IFX_CAN_N_NDAT2_ND41_OFF (9u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND42 */
#define IFX_CAN_N_NDAT2_ND42_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND42 */
#define IFX_CAN_N_NDAT2_ND42_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND42 */
#define IFX_CAN_N_NDAT2_ND42_OFF (10u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND43 */
#define IFX_CAN_N_NDAT2_ND43_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND43 */
#define IFX_CAN_N_NDAT2_ND43_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND43 */
#define IFX_CAN_N_NDAT2_ND43_OFF (11u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND44 */
#define IFX_CAN_N_NDAT2_ND44_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND44 */
#define IFX_CAN_N_NDAT2_ND44_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND44 */
#define IFX_CAN_N_NDAT2_ND44_OFF (12u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND45 */
#define IFX_CAN_N_NDAT2_ND45_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND45 */
#define IFX_CAN_N_NDAT2_ND45_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND45 */
#define IFX_CAN_N_NDAT2_ND45_OFF (13u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND46 */
#define IFX_CAN_N_NDAT2_ND46_LEN (1u)

