Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO11 */
#define IFX_CAN_N_TX_BTO_TO11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO11 */
#define IFX_CAN_N_TX_BTO_TO11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO11 */
#define IFX_CAN_N_TX_BTO_TO11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO12 */
#define IFX_CAN_N_TX_BTO_TO12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO12 */
#define IFX_CAN_N_TX_BTO_TO12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO12 */
#define IFX_CAN_N_TX_BTO_TO12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO13 */
#define IFX_CAN_N_TX_BTO_TO13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO13 */
#define IFX_CAN_N_TX_BTO_TO13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO13 */
#define IFX_CAN_N_TX_BTO_TO13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO14 */
#define IFX_CAN_N_TX_BTO_TO14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO14 */
#define IFX_CAN_N_TX_BTO_TO14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO14 */
#define IFX_CAN_N_TX_BTO_TO14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO15 */
#define IFX_CAN_N_TX_BTO_TO15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO15 */
#define IFX_CAN_N_TX_BTO_TO15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO15 */
#define IFX_CAN_N_TX_BTO_TO15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO16 */
#define IFX_CAN_N_TX_BTO_TO16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO16 */
#define IFX_CAN_N_TX_BTO_TO16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO16 */
#define IFX_CAN_N_TX_BTO_TO16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO17 */
#define IFX_CAN_N_TX_BTO_TO17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO17 */
#define IFX_CAN_N_TX_BTO_TO17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO17 */
#define IFX_CAN_N_TX_BTO_TO17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO18 */
#define IFX_CAN_N_TX_BTO_TO18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO18 */
#define IFX_CAN_N_TX_BTO_TO18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO18 */
#define IFX_CAN_N_TX_BTO_TO18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO19 */
#define IFX_CAN_N_TX_BTO_TO19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO19 */
#define IFX_CAN_N_TX_BTO_TO19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO19 */
#define IFX_CAN_N_TX_BTO_TO19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO20 */
#define IFX_CAN_N_TX_BTO_TO20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO20 */
#define IFX_CAN_N_TX_BTO_TO20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO20 */
#define IFX_CAN_N_TX_BTO_TO20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO21 */
#define IFX_CAN_N_TX_BTO_TO21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO21 */
#define IFX_CAN_N_TX_BTO_TO21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO21 */
#define IFX_CAN_N_TX_BTO_TO21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO22 */
#define IFX_CAN_N_TX_BTO_TO22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO22 */
#define IFX_CAN_N_TX_BTO_TO22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO22 */
#define IFX_CAN_N_TX_BTO_TO22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO23 */
#define IFX_CAN_N_TX_BTO_TO23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO23 */
#define IFX_CAN_N_TX_BTO_TO23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO23 */
#define IFX_CAN_N_TX_BTO_TO23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO24 */
#define IFX_CAN_N_TX_BTO_TO24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO24 */
#define IFX_CAN_N_TX_BTO_TO24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO24 */
#define IFX_CAN_N_TX_BTO_TO24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO25 */
#define IFX_CAN_N_TX_BTO_TO25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO25 */
#define IFX_CAN_N_TX_BTO_TO25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO25 */
#define IFX_CAN_N_TX_BTO_TO25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO26 */
#define IFX_CAN_N_TX_BTO_TO26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO26 */
#define IFX_CAN_N_TX_BTO_TO26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO26 */
#define IFX_CAN_N_TX_BTO_TO26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO27 */
#define IFX_CAN_N_TX_BTO_TO27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO27 */
#define IFX_CAN_N_TX_BTO_TO27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO27 */
#define IFX_CAN_N_TX_BTO_TO27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO28 */
#define IFX_CAN_N_TX_BTO_TO28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO28 */
#define IFX_CAN_N_TX_BTO_TO28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO28 */
#define IFX_CAN_N_TX_BTO_TO28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO29 */
#define IFX_CAN_N_TX_BTO_TO29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO29 */
#define IFX_CAN_N_TX_BTO_TO29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO29 */
#define IFX_CAN_N_TX_BTO_TO29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO30 */
#define IFX_CAN_N_TX_BTO_TO30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO30 */
#define IFX_CAN_N_TX_BTO_TO30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO30 */
#define IFX_CAN_N_TX_BTO_TO30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO31 */
#define IFX_CAN_N_TX_BTO_TO31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO31 */
#define IFX_CAN_N_TX_BTO_TO31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO31 */
#define IFX_CAN_N_TX_BTO_TO31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF0 */
#define IFX_CAN_N_TX_BCF_CF0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF0 */
#define IFX_CAN_N_TX_BCF_CF0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF0 */
#define IFX_CAN_N_TX_BCF_CF0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF1 */
#define IFX_CAN_N_TX_BCF_CF1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF1 */
#define IFX_CAN_N_TX_BCF_CF1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF1 */
#define IFX_CAN_N_TX_BCF_CF1_OFF (1u)

