Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE16 */
#define IFX_CAN_N_TX_BTIE_TIE16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE16 */
#define IFX_CAN_N_TX_BTIE_TIE16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE17 */
#define IFX_CAN_N_TX_BTIE_TIE17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE17 */
#define IFX_CAN_N_TX_BTIE_TIE17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE17 */
#define IFX_CAN_N_TX_BTIE_TIE17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE18 */
#define IFX_CAN_N_TX_BTIE_TIE18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE18 */
#define IFX_CAN_N_TX_BTIE_TIE18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE18 */
#define IFX_CAN_N_TX_BTIE_TIE18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE19 */
#define IFX_CAN_N_TX_BTIE_TIE19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE19 */
#define IFX_CAN_N_TX_BTIE_TIE19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE19 */
#define IFX_CAN_N_TX_BTIE_TIE19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE20 */
#define IFX_CAN_N_TX_BTIE_TIE20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE20 */
#define IFX_CAN_N_TX_BTIE_TIE20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE20 */
#define IFX_CAN_N_TX_BTIE_TIE20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE21 */
#define IFX_CAN_N_TX_BTIE_TIE21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE21 */
#define IFX_CAN_N_TX_BTIE_TIE21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE21 */
#define IFX_CAN_N_TX_BTIE_TIE21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE22 */
#define IFX_CAN_N_TX_BTIE_TIE22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE22 */
#define IFX_CAN_N_TX_BTIE_TIE22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE22 */
#define IFX_CAN_N_TX_BTIE_TIE22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE23 */
#define IFX_CAN_N_TX_BTIE_TIE23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE23 */
#define IFX_CAN_N_TX_BTIE_TIE23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE23 */
#define IFX_CAN_N_TX_BTIE_TIE23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE24 */
#define IFX_CAN_N_TX_BTIE_TIE24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE24 */
#define IFX_CAN_N_TX_BTIE_TIE24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE24 */
#define IFX_CAN_N_TX_BTIE_TIE24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE25 */
#define IFX_CAN_N_TX_BTIE_TIE25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE25 */
#define IFX_CAN_N_TX_BTIE_TIE25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE25 */
#define IFX_CAN_N_TX_BTIE_TIE25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE26 */
#define IFX_CAN_N_TX_BTIE_TIE26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE26 */
#define IFX_CAN_N_TX_BTIE_TIE26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE26 */
#define IFX_CAN_N_TX_BTIE_TIE26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE27 */
#define IFX_CAN_N_TX_BTIE_TIE27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE27 */
#define IFX_CAN_N_TX_BTIE_TIE27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE27 */
#define IFX_CAN_N_TX_BTIE_TIE27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE28 */
#define IFX_CAN_N_TX_BTIE_TIE28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE28 */
#define IFX_CAN_N_TX_BTIE_TIE28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE28 */
#define IFX_CAN_N_TX_BTIE_TIE28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE29 */
#define IFX_CAN_N_TX_BTIE_TIE29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE29 */
#define IFX_CAN_N_TX_BTIE_TIE29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE29 */
#define IFX_CAN_N_TX_BTIE_TIE29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE30 */
#define IFX_CAN_N_TX_BTIE_TIE30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE30 */
#define IFX_CAN_N_TX_BTIE_TIE30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE30 */
#define IFX_CAN_N_TX_BTIE_TIE30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE31 */
#define IFX_CAN_N_TX_BTIE_TIE31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE31 */
#define IFX_CAN_N_TX_BTIE_TIE31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE31 */
#define IFX_CAN_N_TX_BTIE_TIE31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE0 */
#define IFX_CAN_N_TX_BCIE_CFIE0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE0 */
#define IFX_CAN_N_TX_BCIE_CFIE0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE0 */
#define IFX_CAN_N_TX_BCIE_CFIE0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE1 */
#define IFX_CAN_N_TX_BCIE_CFIE1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE1 */
#define IFX_CAN_N_TX_BCIE_CFIE1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE1 */
#define IFX_CAN_N_TX_BCIE_CFIE1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE2 */
#define IFX_CAN_N_TX_BCIE_CFIE2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE2 */
#define IFX_CAN_N_TX_BCIE_CFIE2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE2 */
#define IFX_CAN_N_TX_BCIE_CFIE2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE3 */
#define IFX_CAN_N_TX_BCIE_CFIE3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE3 */
#define IFX_CAN_N_TX_BCIE_CFIE3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE3 */
#define IFX_CAN_N_TX_BCIE_CFIE3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE4 */
#define IFX_CAN_N_TX_BCIE_CFIE4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE4 */
#define IFX_CAN_N_TX_BCIE_CFIE4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE4 */
#define IFX_CAN_N_TX_BCIE_CFIE4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE5 */
#define IFX_CAN_N_TX_BCIE_CFIE5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE5 */
#define IFX_CAN_N_TX_BCIE_CFIE5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE5 */
#define IFX_CAN_N_TX_BCIE_CFIE5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE6 */
#define IFX_CAN_N_TX_BCIE_CFIE6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE6 */
#define IFX_CAN_N_TX_BCIE_CFIE6_MSK (0x1u)

